app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
<ul>
  <% @user.articles.each do |article| %>