app/controllers/articles_controller.rb

  def create
    # @article = Article.new(
    #   title: params[:article][:title],
    #   body: params[:article][:body])

    # @article = Article.new(params[:article]) # this won't work, we need to use a helper instead, with require and permit, we plug in the return of the helper below

    @article = Article.new(article_params)
    @article.user = current_user
    @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first article"], ["body", "body of first article"], ["user_id", 3], ["created_at", "2016-03-20 20:58:48.733694"], ["updated_at", "2016-03-20 20:58:48.733694"]]

  def destroy
    article = Article.find(params[:id])
    flash.notice = "Article '#{article.title}' deleted!"
    article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]