app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]
    @comment.user = current_user
    @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "tre"], ["body", "rte"], ["article_id", 1], ["created_at", "2016-03-20 16:19:19.144135"], ["updated_at", "2016-03-20 16:19:19.144135"]]